@DrFaust92 - Thanks, looks like the test works, but node pool 1 as-built is `EFFECTIVE_CGROUP_MODE_V1`?

```
Step #59 - "verify node-pool-local": TestNodePool 2024-12-28T16:28:24Z command.go:100: Running command gcloud with args [config get-value project --format json]
Step #59 - "verify node-pool-local":     utils.go:110: 
Step #59 - "verify node-pool-local":         	Error Trace:	/workspace/test/integration/testutils/utils.go:110
Step #59 - "verify node-pool-local":         	            				/builder/home/go/pkg/mod/golang.org/x/sync@v0.10.0/errgroup/errgroup.go:78
Step #59 - "verify node-pool-local":         	            				/usr/lib/go/src/runtime/asm_amd64.s:1700
Step #59 - "verify node-pool-local":         	Error:      	Not equal: 
Step #59 - "verify node-pool-local":         	            	expected: "EFFECTIVE_CGROUP_MODE_V2"
Step #59 - "verify node-pool-local":         	            	actual  : "EFFECTIVE_CGROUP_MODE_V1"
Step #59 - "verify node-pool-local":         	            	
Step #59 - "verify node-pool-local":         	            	Diff:
Step #59 - "verify node-pool-local":         	            	--- Expected
Step #59 - "verify node-pool-local":         	            	+++ Actual
Step #59 - "verify node-pool-local":         	            	@@ -1 +1 @@
Step #59 - "verify node-pool-local":         	            	-EFFECTIVE_CGROUP_MODE_V2
Step #59 - "verify node-pool-local":         	            	+EFFECTIVE_CGROUP_MODE_V1
Step #59 - "verify node-pool-local":         	Test:       	TestNodePool
Step #59 - "verify node-pool-local":         	Messages:   	For node pool-01 path "config.effectiveCgroupMode" expected "EFFECTIVE_CGROUP_MODE_V1" to match fixture "EFFECTIVE_CGROUP_MODE_V2"
```

I'm seeing this in the plan (looks like pool-01 IS being created with `"CGROUP_MODE_V1"`):
```
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:   # module.example.module.gke.google_container_node_pool.pools["pool-01"] will be created
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:   + resource "google_container_node_pool" "pools" {
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + cluster                     = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + id                          = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + initial_node_count          = 1
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + instance_group_urls         = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + location                    = "europe-west4"
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + managed_instance_group_urls = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + max_pods_per_node           = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + name                        = "pool-01"
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + name_prefix                 = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + node_count                  = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + node_locations              = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + operation                   = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + project                     = "ci-gke-45fd3c29-ws55"
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + version                     = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + autoscaling {
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + location_policy = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + max_node_count  = 2
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + min_node_count  = 1
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:         }
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + management {
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + auto_repair  = true
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + auto_upgrade = true
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:         }
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + network_config (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:       + node_config {
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + disk_size_gb                = 100
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + disk_type                   = "pd-standard"
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + effective_taints            = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + enable_confidential_storage = false
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + image_type                  = "COS_CONTAINERD"
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + labels                      = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + local_ssd_count             = 0
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + logging_variant             = "DEFAULT"
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + machine_type                = "e2-medium"
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + metadata                    = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + min_cpu_platform            = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + oauth_scopes                = [
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:               + "https://www.googleapis.com/auth/cloud-platform",
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:             ]
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + preemptible                 = false
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + service_account             = "gke-sa-int-test-p1-7ee9@ci-gke-45fd3c29-ws55.iam.gserviceaccount.com"
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + spot                        = false
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + tags                        = (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:             # (1 unchanged attribute hidden)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + confidential_nodes (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + gcfs_config {
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:               + enabled = false
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:             }
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + guest_accelerator (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + kubelet_config (known after apply)
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185: 
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:           + linux_node_config {
Step #58 - "apply node-pool-local": TestNodePool 2024-12-28T16:17:51Z command.go:185:               + cgroup_mode = "CGROUP_MODE_V1"
```


Also for the cluster:
```
Step #59 - "verify node-pool-local": TestNodePool 2024-12-28T16:28:17Z command.go:100: Running command gcloud with args [config get-value project --format json]
Step #59 - "verify node-pool-local":     golden.go:160: 
Step #59 - "verify node-pool-local":         	Error Trace:	/builder/home/go/pkg/mod/github.com/!google!cloud!platform/cloud-foundation-toolkit/infra/blueprint-test@v0.17.3/pkg/golden/golden.go:160
Step #59 - "verify node-pool-local":         	            				/builder/home/go/pkg/mod/github.com/!google!cloud!platform/cloud-foundation-toolkit/infra/blueprint-test@v0.17.3/pkg/golden/golden.go:171
Step #59 - "verify node-pool-local":         	            				/builder/home/go/pkg/mod/golang.org/x/sync@v0.10.0/errgroup/errgroup.go:78
Step #59 - "verify node-pool-local":         	            				/usr/lib/go/src/runtime/asm_amd64.s:1700
Step #59 - "verify node-pool-local":         	Error:      	Not equal: 
Step #59 - "verify node-pool-local":         	            	expected: "EFFECTIVE_CGROUP_MODE_V1"
Step #59 - "verify node-pool-local":         	            	actual  : "EFFECTIVE_CGROUP_MODE_V2"
Step #59 - "verify node-pool-local":         	            	
Step #59 - "verify node-pool-local":         	            	Diff:
Step #59 - "verify node-pool-local":         	            	--- Expected
Step #59 - "verify node-pool-local":         	            	+++ Actual
Step #59 - "verify node-pool-local":         	            	@@ -1 +1 @@
Step #59 - "verify node-pool-local":         	            	-EFFECTIVE_CGROUP_MODE_V1
Step #59 - "verify node-pool-local":         	            	+EFFECTIVE_CGROUP_MODE_V2
Step #59 - "verify node-pool-local":         	Test:       	TestNodePool
Step #59 - "verify node-pool-local":         	Messages:   	For path "nodeConfig.effectiveCgroupMode" expected "EFFECTIVE_CGROUP_MODE_V2" to match fixture "EFFECTIVE_CGROUP_MODE_V1"
```